oblique_numerical_diffusion/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    // Inlet
    "(X|Y)_min"
    {
        type            zeroGradient;
    }

    // Outlet
    "(X|Y)_max"
    {
        type            fixedValue;
        value           $internalField;
    }

    "(Z_min|Z_max)"
    {
        type            empty;
    }

}


// ************************************************************************* //
