oblique_numerical_diffusion/0/s
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      s;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    // Inlet
    X_min
    {
        type            fixedValue;
        value           uniform 1;
    }
    Y_min
    {
        type            fixedValue;
        value           uniform 0;
    }

    // Outlet
    "(X|Y)_max"
    {
        type            zeroGradient;
    }

    "(Z_min|Z_max)"
    {
        type            empty;
    }

}

// ************************************************************************* //
