oblique_numerical_diffusion/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    s{
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-9;
        relTol          1e-3;
    }
}

PIMPLE
{
    nCorrectors                 2;
    nNonOrthogonalCorrectors    1;
    nOuterCorrectors            1;
}

// ************************************************************************* //
